Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: If the 'message' string is displayed, the terminal control character filtering discussed in [SSH-ARCH] should be used to avoid attacks by sending terminal control characters.
ja: 'message' 文字列を表示するなら, [SSH-ARCH]での議論のように, 端末の制御文字を利用した攻撃を避けるために制御文字のフィルタを用いる必要がある.

source: This value is called the exchange hash, and it is used to authenticate the key exchange.
ja: この値は交換ハッシュと呼ばれる. 鍵交換を認証するのに用いられる.

source: If this message is received by the server before the GSS-API context is fully established, the server MUST fail the authentication.
ja: GSS-APIコンテキストが完全に確立する前にこのメッセージをサーバが受け取ったら, サーバは認証を失敗させなければならない.

source: It should be at least twice as long as the key material that is generated from the shared secret.
ja: プライベート指数は, 共有の秘密から生成される鍵の素材の少なくとも2倍の長さが必要だ.

source: Second SSH_MSG_USERAUTH_REQUEST Message ...................11 6.
ja: 2 番目の SSH_MSG_USERAUTH_REQUEST メッセージ ...................11 6.

source: Common practice is to authenticate once with password authentication and transfer the public key to the server.
ja: 一度パスワード認証で認証しサーバに公開鍵を転送するのが一般的な方法だ.

source: The RDATA for a SSHFP RR consists of an algorithm number, fingerprint type and the fingerprint of the public host key.
ja: SSHFP RR の ＲＤＡＴＡ は, アルゴリズム番号と署名の種類, 公開鍵の指紋で構成される.

source: The signature is sent using the following packet:
ja: 署名は, 次のパケットを用いて送られる:

source: If no "command-override" attribute is specified, all "exec" and "shell" requests should be permitted (as long as they satisfy other security or authorization checks the server may perform).
ja: "command-override" 属性が指定されなければ, すべての "exec" と "shell" 要求は許可される必要がある (サーバが行なう他のセキュリティや認証の検査を満している限り).

source: Debug Messages
ja: デバッグメッセージ

source: server host key algorithms x509v3-ecdsa-sha2-nistp256 [SSH-X509] x509v3-ecdsa-sha2-nistp384 [SSH-X509]
ja: サーバホスト鍵アルゴリズム x509v3-ecdsa-sha2-nistp256 [SSH-X509] x509v3-ecdsa-sha2-nistp384 [SSH-X509]

source: It is expected that this protocol will sometimes be used without first verifying the association between the server host key and the server host name.
ja: 場合によっては, サーバホスト鍵とサーバホスト名の関係を最初に検証すうことなしにこのプロトコルが利用されることが, 期待される.

source: Information in this section is only relevant for implementations supporting compatibility with SSH versions 1.x.
ja: この節では, SSH バージョン 1.x との互換性をサポートする実装にのみ関係する情報を記述する.

source: Section 10 specifies REQUIRED and RECOMMENDED elliptic curve domain parameters to be used with the public key algorithms and key exchange methods defined in this document.
ja: 10節で, この文書で定義された公開鍵アルゴリズムと鍵交換法と共に用いられる必須と推奨の楕円曲線ドメインパラメータを定義している.

source: It MUST NOT try this method if initial key exchange was not performed using a GSS-API-based key exchange method defined in accordance with Section 2.
ja: 2 節に従って定義された GSS-API ベースの鍵交換法を用いずに最初の鍵交換が行なわれたら, クライアントはこの認証法を試してはならない.

source: Since the host key is used in the generation of the shared secret, allowing for implicit server authentication, the domain parameters associated with the host key are used throughout this section.
ja: ホスト鍵が共有の秘密の生成に用いられるため, 暗黙的なサーバの認証を考慮すると, ホスト鍵に関連するドメインパラメータはこの節の間中用いられる.

source: This mechanism encodes all NETCONF messages with a chunked framing.
ja: このメカニズムは, チャンクされたフレーミングを用いてすべての NETCONF メッセージをエンコードする.

source: Researchers ([DAI,BKN1,BKN2]) have, however, identified several security problems with the symmetric portion of the SSH Transport Protocol, as described in [RFC4253].
ja: しかし, 研究者 ([DAI,BKN1,BKN2]) が, [RFC4253]で記述されたSSH トランスポートプロトコルの対称部分にいくつかのセキュリティの問題を確認した.

source: For all the XML lines (except the last one), this example treats the LineFeed as part of the chunk-data and so contributing to the chunk-size.
ja: (最終行を覗く)すべての XML の行で, この例ではラインフィードを chunk-data の一部分として扱い chunk-size に含めている.

source: Begin and End Markers ......................................3 3.3.
ja: 開始と終了のマーカー ......................................3 3.3.

source: One common way to do this is to construct the targ_name from the hostname as typed by the user; unfortunately, because some GSS-API mechanisms do not canonicalize hostnames, it is likely that this technique will fail if the user has not typed a fully-qualified, canonical hostname.
ja: これを行なう一般的な方法として, ユーザが入力した ホスト名から targ_name を構築するものがある. 残念ながら, GSS-API メカニズムには ホスト名を正規化しないものがあるので, ユーザが完全に正規化されたホスト名を入力しない場合にこのテクニックが失敗する場合がある.

source: The chunk-size field is a string of decimal digits indicating the number of octets in chunk-data.
ja: chunk-size フィールドは, chunk-data のオクテット数を示す10進数の文字列だ.

source: 57 NOFLSH Don't flush after interrupt.
ja: 57 NOFLSH 割り込みの後でflushしない.

source: Notifications and Proxy
ja: 通知とプロキシ

source: Copyright (c) 2009 IETF Trust and the persons identified as the document authors.
ja: Copyright (c) 2009 IETF Trust and the persons identified as the document authors. 訳者: 春山征吾 <haruyama@unixuser.org>

source: first_kex_packet_follows Indicates whether a guessed key exchange packet follows.
ja: first_kex_packet_follows (鍵交換法を事前に)推測した鍵交換パケットが後に続くかどうかを示す.

source: AEAD_AES_128_GCM is specified in Section 5.1 of [RFC5116].
ja: AEAD_AES_128_GCM は, [RFC5116] の5.1節で指定されている.

source: All implementations MUST be able to process packets with an uncompressed payload length of 32768 bytes or less and a total packet size of 35000 bytes or less (including 'packet_length', 'padding_length', 'payload', 'random padding', and 'mac').
ja: すべての実装は, 32768byte以下の非圧縮の payload を持つパケットを処理できなければならない. また, 全パケットサイズ( 'packet_length', 'padding_length', 'payload', 'random padding', 'mac' を含む) が 35000 byte 以下のパケットを処理できなければならない.

source: Algorithm Number Specification ......................4 3.1.2.
ja: アルゴリズム番号の仕様 .......................4 3.1.2.

source: The prompt field(s) MUST NOT be empty strings.
ja: prompt フィールドは 空文字列であってはならない.

source: Algorithm selection depends on whether the chosen key exchange algorithm requires a signature or an encryption-capable host key.
ja: アルゴリズムの選択は, 選択された鍵交換アルゴリズムが署名ないし暗号化可能なホスト鍵を必要とするかどうかに依存する.

source: Allocation of the following types of names in the SSH protocols is assigned by IETF consensus:
ja: SSH プロトコルの次の種類の名前の割当ては, IETFの合意で行なわれる.

source: Copyright (c) 2011 IETF Trust and the persons identified as the document authors.
ja: Copyright (c) 2011 IETF Trust and the persons identified as the document authors. 訳者: 春山征吾 <haruyama@unixuser.org>

source: SNMP versions prior to SNMPv3 did not include adequate security.
ja: SNMPv3 より前の SNMP バージョンは, 適切なセキュリティを含んでいなかった.

source: The "ssh-dss" key format has the following specific encoding:
ja: "ssh-dss" 鍵フォーマットは次のエンコーディングを持つ:

source: For the purposes of server authentication, it is RECOMMENDED that implementations support the following mechanism mapping host names to certificates.
ja: サーバの認証のために, ホスト名と証明書のマッピングをする次のメカニズムを実装がサポートすることが推奨される.

source: Certification authorities that issue certificates for use by Secure Shell servers SHOULD support the DNS-ID identifier type.
ja: セキュアシェルサーバで用いられる証明書を発行する認証局は, DNS-ID 識別子型をサポートする必要がある.

source: Suite B Secure Shell makes use of the elliptic curve Diffie-Hellman (ECDH) key agreement, the elliptic curve digital signature algorithm (ECDSA), the Advanced Encryption Standard running in Galois/Counter Mode (AES-GCM), two members of the SHA-2 family of hashes (SHA-256 and SHA-384), and X.509 certificates.
ja: Suite B セキュアシェルは, 楕円曲線 Diffie-Hellman (ECDH) 鍵合意や, 楕円曲線デジタル署名アルゴリズム (ECDSA), Galios(ガロア)/カウンダーモードでの Advanced Encryption Standard (AES-GCM), SHA-2 ファミリのハッシュの2つのメンバ (SHA-256 and SHA-384), X.509 証明書を利用する.

source: In particular, the targ_name to pass to GSS_Init_sec_context() is obtained by calling GSS_Import_name() with an input_name_type of GSS_C_NT_HOSTBASED_SERVICE, and an input_name_string consisting of the string "host@" concatenated with the hostname of the SSH server.
ja: 具体的には, GSS_Init_sec_context() に渡す targ_name は, input_name_type を GSS_C_NT_HOSTBASED_SERVICE に input_name_string を "host@" にSSHサーバのホスト名を連結した文字列にしてGSS_Import_name() を呼び出すことで得られる.

source: GSS-API Session
ja: GSS-API セッション

source: Security Properties
ja: セキュリティの特性

source: Using the notation defined in [RFC5116], the input and output lengths for AEAD_AES_256_GCM in secure shell are as follows:
ja: [RFC5116] で定義された表記法を用いると, セキュアシェルでの AEAD_AES_256_GCMの入力長と出力長は以下となる:

source: No acknowledgement is sent for this message.
ja: このメッセージには応答は返らない.

source: Security Considerations .
ja: セキュリティの考察 .

source: Conventions ........................................10 4.5.2.
ja: 規約 ........................................10 4.5.2.

source: Either password changing was not supported, or the old password was bad.
ja: パスワードの変更がサポートされていないか, 古いパスワードが間違っている.

source: Exiting the NETCONF Subsystem .
ja: NETCONF サブシステムの終了 .

source: Two different trust models can be used:
ja: 2つの異なる信頼モデルが利用できる:

source: The command should be executed by the server when it receives an "exec" or "shell" request from the client, in place of the command or shell which would otherwise have been executed as a result of that request.
ja: クライアントから "exec" か "shell" の要求があった場合に, その要求の結果として他では実行される(要求で指定された)コマンドやシェルの変わりに, ("command-override" で)指定されたコマンドはサーバで実行される必要がある.

source: Connection protocol:
ja: コネクション プロトコル:

source: Secure shell provides two other mechanisms, random padding and SSH_MSG_IGNORE messages, that are far more effective than encrypting the packet length in masking any structure in the underlying plaintext stream that might be revealed by the length of the binary packets.
ja: セキュアシェルは別の2つのメカニズムを提供している. ランダムパディングと SSH_MSG_IGNORE メッセージだ. これらは, バイナリパケットの長さによって解明される可能性がある基底の平文ストリームの構造をマスクする packet length の暗号化よりもよっぽど効果的だ.

source: A NETCONF over SSH session, using the backwards-compatible end-of- message framing to retrieve a set of configuration information, might look like this:
ja: 後方互換なメッセージ終了フレーミングを用いて設定情報の集合を取得する SSH セッション上の NETCONF は次のようになる:

source: If there is no user name in the tmTransportAddress, then the tmSecurityName should be used as the user name.
ja: tmTransportAddress に ユーザ名がなければ, tmSecurityName がユーザ名として用いられる必要がある.

source: This memo describes a Transport Model for the Simple Network Management Protocol (SNMP), using the Secure Shell (SSH) protocol.
ja: このメモは, セキュアシェル (SSH) を用いる シンプルネットワークマネジメントプロトコル (SNMP) のためのトランスポートモデルを記述する.

source: This method is suitable for interactive authentication methods that do not need any special software support on the client side.
ja: この方法は, クライアント側に特別なソフトウェアのサポートが必要ないインタラクティブな認証法に適している.

source: How SSHTM Fits into the Transport Subsystem
ja: どのように SSHTM はトランスポートサブシステムに適合するか

source: The "serpent128-cbc" cipher is the same as above, but with a 128-bit key.
ja: "serpent128-cbc" 暗号は, 同様の暗号だが, 128-bit の鍵を使う.

source: "snmp" as a Connection Protocol Subsystem Name in the SSH Protocol Parameters registry.
ja: SSH Protocol Parameters レジストリの Connection Protocol Subsystem Name として, "snmp".

source: The SSH connection protocol allows for proxy forwarding of other protocols such as SMTP, POP3, and HTTP.
ja: SSH コネクションプロトコルは, SMTPやPOP3, HTTPといった別のプロトコルのプロキシ転送を許可する.

source: Disconnection Message 'reason code' values in that range are left for PRIVATE USE, as described in [RFC2434].
ja: その範囲の切断メッセージの 'reason code'の値は, やはり [RFC2434]に記述されている プライベートな利用 (PRIVATE USE) に予約されている.

source: Each of these components plays a part in the security of the resulting connection, and each will have its own security considerations.
ja: これらの要素それぞれが, 結果として生じる接続のセキュリティのある部分をになっており, それぞれが自身のセキュリティの考慮事項を持つ.

source: Since Pretty Good Privacy (PGP) has its own method for binding a public key to a digital identity, this document focuses solely upon the non-PGP methods.
ja: Pretty Good Privacy (PGP) は公開鍵と電子IDを束縛する独自の方法を持っているので, この文書では非PGPな方法のみに集中する.

source: The key exchange produces two values: a shared secret K, and an exchange hash H. Encryption and authentication keys are derived from these.
ja: 鍵交換は2つの値を生成する: 共有の秘密 K と 交換ハッシュ H だ. 暗号化と認証の鍵はこれらから導出される.

source: The key format has the following specific encoding:
ja: 鍵フォーマットは次のエンコーディングを持つ:

source: Allowed Server Host Key Algorithm Name Lists
ja: 受け入れられるサーバホスト鍵アルゴリズムの name-list

source: Requests for assignments of new Disconnection Message 'reason code' values, and their associated Disconnection Message 'description' text, in the range of 0x00000010 through 0xFDFFFFFF, MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: 新しい切断メッセージの 'reason code' の値と関連する切断メッセージの 'description' を割り当てる要求は, 0x00000010 から 0xFDFFFFFF の範囲については [RFC2434] に記述されている IETF CONSENSUS におってされなければならない

source: Public Key Authentication Method: "publickey" ...................8 8.
ja: 公開鍵認証法: "publickey" ...................8 8.

source: The following table identifies the initial assignments of the Message ID values.
ja: 次の表で, メッセージIDの値の初期の割り当てを示す

source: The KeyUsage extension MAY be used to restrict a certificate's use.
ja: KeyUsage 拡張は, 証明書の利用を制限するの用いられてもよい.

source: The server will respond with zero or more of the following responses:
ja: サーバは, 0以上の以下の応答を返す:

source: 3 VERASE Erase the character to left of the cursor.
ja: 3 VERASE カーソルの左側の文字を消す.

source: The client initiates the authentication with an SSH_MSG_USERAUTH_REQUEST message.
ja: クライアントは認証を SSH_MSG_USERAUTH_REQUEST メッセージで開始する.

source: The SSH protocols refer to particular hash, encryption, integrity, compression, and key exchange algorithms or methods by name.
ja: SSH プロトコルは, 特定のハッシュや暗号, 完全性, 圧縮, 鍵交換のアルゴリズムや方式を名前で参照する.

source: The other parameters of the transport connection are provided in an implementation-dependent manner.
ja: トランスポート接続の他のパラメータは, 実装依存の方法で提供される.

source: Notation ........................................................4 3.
ja: 表記法 ........................................................4 3.

source: An SSH Subsystem of type "snmp" is opened by the SSH Transport Model during the elements of procedure for an outgoing SNMP message.
ja: タイプ "snmp" の SSH サブシステムは, 送信 SNMP メッセージのための手順の要素の中で, SSH トランスポートモデルによって開始される.

source: If the "null" host key algorithm described in Section 5 is used, this message MUST NOT be sent.
ja: 5節で記述する "null" ホスト鍵アルゴリズムを利用する場合は, このメッセージを送ってはならない.

source: Implementations providing and processing OCSP responses MUST comply with [RFC2560].
ja: OCSP 応答を提供/処理する実装は, [RFC2560]に従わなければならない.

source: This makes it possible for the server to avoid disclosing information about which accounts exist.
ja: これにより， アカウントが存在するかの情報をサーバが漏らすのを避けることができる．

source: The compression algorithm names are listed in Section 6.2.
ja: 圧縮アルゴリズム名は, 6.2節に挙げられている.

source: Starting NETCONF over SSH
ja: SSH 上での NETCONF の起動

source: Man-in-the-middle ..................................17 9.3.5.
ja: 中間者 ..................................17 9.3.5.

source: It can legally appear in XML attributes, comments, and processing instructions.
ja: これは, 正当に XML 属性やコメントや処理命令に出現する可能性がある.

source: When tmSameSecurity is set, the recorded tmSessionID can be used to determine whether the SSH session available for sending a corresponding outgoing message is the same SSH session as was used when receiving the incoming message (e.g., a response to a request).
ja: tmSameSecurity が設定されている場合, 記録された tmSessionID は, 関連する送信メッセージを送信するに利用可能な SSH のセッションが, 受信メッセージ (例えば要求への応答)を受信する際に用いられたのと同じセッションかどうかを判定するのに用いることができる.

source: If a collision is found, then the payload data associated with those two ciphertexts is probably identical.
ja: 衝突が見付かったら, それらの2つの暗号文のペイロードデータは, おそらく同一だ.

source: This key exchange method provides explicit server authentication as defined in [RFC4253] using a signature on the exchange hash.
ja: この鍵交換法は, 交換ハッシュ(exchange hash) の署名を用いる [RFC4253] で定義された明示的なサーバ認証を提供する.

source: Determine the tmSecurityName to be associated with the incoming message:
ja: 受信メッセージに関連した tmSecurityName を決定する.

source: No interoperability is expected for anything used in this range.
ja: この範囲を利用する際は, 相互運用性は期待されない.

source: Skipping Public Key Verification ..........................31 9.2.
ja: 公開鍵検証のスキップ ..........................31 9.2.

source: Developers should consider minimizing the amount of sensitive information obtainable by users during the authentication phase, in accordance with the local policies.
ja: 開発者は, ローカルなポリシーに従って, 認証のフェイズでユーザが得られる重要な情報の量を最小化することを考慮すべきだ.

source: The authentication method name for this protocol is "gssapi-with- mic".
ja: このプロトコルの認証法名は "gssapi-with-mic" だ.

source: To perform actual authentication, the client MAY then send a signature generated using the private key.
ja: それから, 実際の認証を行なうために, クライアントは, 秘密鍵を用いて生成した署名を送ってもよい.

source: Non-Encryption of Packet Length
ja: Packet Length の非暗号化

source: The client requests this form of authentication by sending the following message.
ja: クライアントは, 次のメッセージを送ることでこの認証法を要求する.

source: A graphical user interface (GUI) client has many choices on how to prompt the user.
ja: グラフィカルユーザインタフェイス (GUI) クライアントは, ユーザにプロンプトを出すためにたくさんの選択肢がある.

source: Constraints ................................................6 2.
ja: 制約 ................................................6 2.

source: The key K_T is encoded according to the "ssh-rsa" scheme described in Section 6.6 of [RFC4253].
ja: 鍵 K_T は, [RFC4253]の 6.6 節で記述されている "ssh-rsa" 方式に従ってエンコードされる.

source: The server SHOULD have a timeout for authentication and disconnect if the authentication has not been accepted within the timeout period.
ja: サーアは, 認証のタイムアウト期間を持つ必要がある. また, そのタイムアウト期間内に認証が受け入れられなかった場合に切断する必要がある.

source: All keys and initialization vectors are recomputed after the exchange.
ja: 交換のあとで, すべての鍵と初期化ベクトルが再計算される.

source: This document specifies how to use X.509 version 3 public key certificates in public key algorithms in the Secure Shell protocol.
ja: この文書は, セキュアシェルの公開鍵アルゴリズムで X.509 バージョン 3 公開鍵証明書を使う方法を指定する.

source: Implementers may wish to check if there are any unsent packets awaiting transmission; unfortunately, it is not normally easy to obtain this information from the kernel or buffers.
ja: 実装者は, 転送待ちの未送信パケットがあるかどうかチェックしたいだろうが, カーネルやバッファの情報を知るには通常容易ではない

source: For the remaining certificates in the certificate chain, implementations MUST comply with existing conventions on KeyUsage identifiers and certificates as in Section 4.2.1.3 of [RFC5280].
ja: 証明書チェーンの残りの証明書のために, [RFC5280] の 4.2.1.3 節にあるように KeyUsage 識別子と証明書の既存の規約に実装は従わなければならない.

source: It is intended only for the initialization of the IANA registries referenced in the set of SSH documents.
ja: SSHの文書群で参照されるIANAのレジストリの初期化のみが目的だ.

source: Disconnection Message
ja: 切断メッセージ

source: If the server rejects the service request, it SHOULD send an appropriate SSH_MSG_DISCONNECT message and MUST disconnect.
ja: サーバがサービスの要求を拒否するなら, 適切な SSH_MSG_DISCONNECT メッセージを送る必要がある. そして 切断しなければならない.

source: Server administrators are encouraged to make host key fingerprints available for checking by some means whose security does not rely on the integrity of the actual host keys.
ja: サーバの管理者には, 実際のホスト鍵の完全性に依存しないセキュリティを持ついくつかの手段で, ホスト鍵の指紋を検査用に有効にしておくことが推奨される.

source: statusInformation = sendMessage( IN destTransportDomain -- transport domain to be used IN destTransportAddress -- transport address to be used IN outgoingMessage -- the message to send IN outgoingMessageLength -- its length IN tmStateReference -- (NEW) transport info )
ja: statusInformation = sendMessage( IN destTransportDomain -- 利用されるトランスポートドメイン IN destTransportAddress -- 利用されるトランスポートアドレス IN outgoingMessage -- 送信するメッセージ IN outgoingMessageLength -- その長さ IN tmStateReference -- (NEW) トランスポートの情報 )

source: When a party will no longer send more data to a channel, it SHOULD send SSH_MSG_CHANNEL_EOF.
ja: チャンネルにもうこれ以上データを送らないなら, SSH_MSG_CHANNEL_EOF を送る必要がある.

source: Requests for assignments of new status codes in the range of 0 to 191 MUST be done through the Standards Action method as described in [11].
ja: 0から191の範囲に新たな状態コードを割り当てる要求は, [11] に記述されている IETF CONSENSUS によってされなければならない.

source: There are, however, several factors that make this a non-issue in almost all cases:
ja: しかし, いくつかの理由によりほとんどすべての場合で重大とならない.

source: 10 VSUSP Suspends the current program.
ja: 10 VSUSP 現在のプログラムを中断する.

source: The part following the at-sign MUST be a valid, fully qualified internet domain name [RFC1034] controlled by the person or organization defining the name.
ja: アットマークに続く部分は, 名前を定義する個人ないし組織で管理されている有効な完全に記述したドメイン名 [RFC1034]でなければならない.

source: The fingerprint of a public key consists of the output of the MD5 message-digest algorithm [RFC1321].
ja: 公開鍵の指紋は, MD5 メッセージダイジェストアルゴリズム[RFC1321] の出力から構成される.

source: Additional SSH_MSG_USERAUTH_GSSAPI_TOKEN messages are sent if and only if the calls to the GSS-API routines produce send tokens of non- zero length.
ja: GSS-API ルーチンの呼び出しが0でない長さの送信トークンを生成したときのみ， 追加のSSH_MSG_USERAUTH_GSSAPI_TOKEN メッセージは送られる．

source: It is desirable to use mechanisms that could unify the approach for administrative security for SNMPv3 and command line interfaces (CLI) and other management interfaces.
ja: SNMPv3 とコマンドラインインターフェイス(CLI), 他の管理のインターフェイス のためのセキュリティを管理するアプローチを統合するメカニズムを利用するのが望ましい.

source: A partial flush means that the current compressed block is ended and all data will be output.
ja: 部分的な flush とは, 現在の圧縮ブロックが終了されてすべてのデータが出力となっているということである.

source: Exiting NETCONF is accomplished using the <close-session> operation.
ja: NETCONF の終了は, <close-session> 操作を用いて行なわれる.
